SWITCHSCIENCE/Arduino_Board_Package/nrf52/boards.txt
menu.softdevice=Bootloader
menu.debug=Debug

# ----------------------------------
# Switch Science ISP1807 Breakout
# ----------------------------------
isp1807breakout.name=Switch Science ISP1807 Breakout
isp1807breakout.bootloader.tool=adafruit:bootburn

# Upload
isp1807breakout.upload.tool=adafruit:nrfutil
isp1807breakout.upload.protocol=nrfutil
isp1807breakout.upload.use_1200bps_touch=true
isp1807breakout.upload.wait_for_upload_port=true
isp1807breakout.upload.maximum_size=815104
isp1807breakout.upload.maximum_data_size=237568

# Build
isp1807breakout.build.mcu=cortex-m4
isp1807breakout.build.f_cpu=64000000
isp1807breakout.build.board=SSCI_ISP1807_BREAKOUT
isp1807breakout.build.core=adafruit:nRF5
isp1807breakout.build.variant=isp1807breakout
isp1807breakout.build.usb_manufacturer="Switch Science, Inc."
isp1807breakout.build.usb_product="SSCI ISP1807 Breakout"
isp1807breakout.build.extra_flags=-DNRF52840_XXAA {build.flags.usb} "-I{build.core.path}/../../libraries/Adafruit_TinyUSB_Arduino/src/arduino"
isp1807breakout.build.ldscript=nrf52840_s140_v6.ld
isp1807breakout.build.vid=0x2786
isp1807breakout.build.pid=0x920D

# SofDevice Menu
isp1807breakout.menu.softdevice.s140v6=0.3.2 SoftDevice s140 6.1.1
isp1807breakout.menu.softdevice.s140v6.build.sd_name=s140
isp1807breakout.menu.softdevice.s140v6.build.sd_version=6.1.1
isp1807breakout.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
isp1807breakout.menu.debug.l0=Level 0 (Release)
isp1807breakout.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
isp1807breakout.menu.debug.l1=Level 1 (Error Message)
isp1807breakout.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
isp1807breakout.menu.debug.l2=Level 2 (Full Debug)
isp1807breakout.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
isp1807breakout.menu.debug.l3=Level 3 (Segger SystemView)
isp1807breakout.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
isp1807breakout.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Switch Science ISP1507 Breakout
# ----------------------------------
isp1507breakout.name=Switch Science ISP1507 Breakout
isp1507breakout.bootloader.tool=adafruit:bootburn

# Upload
isp1507breakout.upload.tool=adafruit:nrfutil
isp1507breakout.upload.protocol=nrfutil
isp1507breakout.upload.use_1200bps_touch=false
isp1507breakout.upload.wait_for_upload_port=false
isp1507breakout.upload.native_usb=false
isp1507breakout.upload.maximum_size=290816
isp1507breakout.upload.maximum_data_size=52224

# Build
isp1507breakout.build.mcu=cortex-m4
isp1507breakout.build.f_cpu=64000000
isp1507breakout.build.board=SSCI_ISP1507_BREAKOUT
isp1507breakout.build.core=adafruit:nRF5
isp1507breakout.build.variant=adafruit:feather_nrf52832
isp1507breakout.build.usb_manufacturer="Switch Science, Inc."
isp1507breakout.build.usb_product="SSCI ISP1507 Breakout"
isp1507breakout.build.extra_flags=-DNRF52832_XXAA -DNRF52
isp1507breakout.build.ldscript=nrf52832_s132_v6.ld

# SofDevice Menu
isp1507breakout.menu.softdevice.s132v6=0.3.2 SoftDevice s132 6.1.1
isp1507breakout.menu.softdevice.s132v6.build.sd_name=s132
isp1507breakout.menu.softdevice.s132v6.build.sd_version=6.1.1
isp1507breakout.menu.softdevice.s132v6.build.sd_fwid=0x00B7

# Debug Menu
isp1507breakout.menu.debug.l0=Level 0 (Release)
isp1507breakout.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
isp1507breakout.menu.debug.l1=Level 1 (Error Message)
isp1507breakout.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
isp1507breakout.menu.debug.l2=Level 2 (Full Debug)
isp1507breakout.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
isp1507breakout.menu.debug.l3=Level 3 (Segger SystemView)
isp1507breakout.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
isp1507breakout.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Switch Science BLE-SS dev board Multi Sensor
# ----------------------------------
blessdevboardmultisensor.name=Switch Science BLE-SS dev board Multi Sensor

# VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
blessdevboardmultisensor.vid.0=0x2786
blessdevboardmultisensor.pid.0=0x920A
blessdevboardmultisensor.vid.1=0x2786
blessdevboardmultisensor.pid.1=0x9208
blessdevboardmultisensor.vid.2=0x2786
blessdevboardmultisensor.pid.2=0x9209
blessdevboardmultisensor.vid.3=0x2786
blessdevboardmultisensor.pid.3=0x9207

# Upload
blessdevboardmultisensor.bootloader.tool=adafruit:bootburn
blessdevboardmultisensor.upload.tool=adafruit:nrfutil
blessdevboardmultisensor.upload.protocol=nrfutil
blessdevboardmultisensor.upload.use_1200bps_touch=true
blessdevboardmultisensor.upload.wait_for_upload_port=true
blessdevboardmultisensor.upload.maximum_size=815104
blessdevboardmultisensor.upload.maximum_data_size=237568

# Build
blessdevboardmultisensor.build.mcu=cortex-m4
blessdevboardmultisensor.build.f_cpu=64000000
blessdevboardmultisensor.build.board=BLE_SS_DEV_BOARD_MULTI_SENSOR
blessdevboardmultisensor.build.core=adafruit:nRF5
blessdevboardmultisensor.build.variant=bless_dev_board_multi_sensor
blessdevboardmultisensor.build.usb_manufacturer="Switch Science, Inc."
blessdevboardmultisensor.build.usb_product="BLE-SS dev board Multi Sensor"
blessdevboardmultisensor.build.extra_flags=-DNRF52840_XXAA {build.flags.usb} "-I{build.core.path}/../../libraries/Adafruit_TinyUSB_Arduino/src/arduino"
blessdevboardmultisensor.build.ldscript=nrf52840_s140_v6.ld
blessdevboardmultisensor.build.vid=0x2786
blessdevboardmultisensor.build.pid=0x920A

# SofDevice Menu
blessdevboardmultisensor.menu.softdevice.s140v6=0.3.2 SoftDevice s140 6.1.1
blessdevboardmultisensor.menu.softdevice.s140v6.build.sd_name=s140
blessdevboardmultisensor.menu.softdevice.s140v6.build.sd_version=6.1.1
blessdevboardmultisensor.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
blessdevboardmultisensor.menu.debug.l0=Level 0 (Release)
blessdevboardmultisensor.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
blessdevboardmultisensor.menu.debug.l1=Level 1 (Error Message)
blessdevboardmultisensor.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
blessdevboardmultisensor.menu.debug.l2=Level 2 (Full Debug)
blessdevboardmultisensor.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
blessdevboardmultisensor.menu.debug.l3=Level 3 (Segger SystemView)
blessdevboardmultisensor.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
blessdevboardmultisensor.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Switch Science ISP1807 Micro Board
# ----------------------------------
isp1807microboard.name=Switch Science ISP1807 Micro Board
isp1807microboard.bootloader.tool=adafruit:bootburn

# Upload
isp1807microboard.upload.tool=adafruit:nrfutil
isp1807microboard.upload.protocol=nrfutil
isp1807microboard.upload.use_1200bps_touch=true
isp1807microboard.upload.wait_for_upload_port=true
isp1807microboard.upload.maximum_size=815104
isp1807microboard.upload.maximum_data_size=237568

# Build
isp1807microboard.build.mcu=cortex-m4
isp1807microboard.build.f_cpu=64000000
isp1807microboard.build.board=SSCI_ISP1807_MICRO_BOARD
isp1807microboard.build.core=adafruit:nRF5
isp1807microboard.build.variant=isp1807microboard
isp1807microboard.build.usb_manufacturer="Switch Science, Inc."
isp1807microboard.build.usb_product="SSCI ISP1807 Micro Board"
isp1807microboard.build.extra_flags=-DNRF52840_XXAA {build.flags.usb} "-I{build.core.path}/../../libraries/Adafruit_TinyUSB_Arduino/src/arduino"
isp1807microboard.build.ldscript=nrf52840_s140_v6.ld
isp1807microboard.build.vid=0x2786
isp1807microboard.build.pid=0x920D

# SofDevice Menu
isp1807microboard.menu.softdevice.s140v6=0.3.2 SoftDevice s140 6.1.1
isp1807microboard.menu.softdevice.s140v6.build.sd_name=s140
isp1807microboard.menu.softdevice.s140v6.build.sd_version=6.1.1
isp1807microboard.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
isp1807microboard.menu.debug.l0=Level 0 (Release)
isp1807microboard.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
isp1807microboard.menu.debug.l1=Level 1 (Error Message)
isp1807microboard.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
isp1807microboard.menu.debug.l2=Level 2 (Full Debug)
isp1807microboard.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
isp1807microboard.menu.debug.l3=Level 3 (Segger SystemView)
isp1807microboard.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
isp1807microboard.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Raytac MDBT50Q-RX Dongle (Bootloader available)
# ----------------------------------
mdbt50qrx.name=Raytac MDBT50Q-RX Dongle (Bootloader available)
mdbt50qrx.bootloader.tool=adafruit:bootburn

# Upload
mdbt50qrx.upload.tool=adafruit:nrfutil
mdbt50qrx.upload.protocol=nrfutil
mdbt50qrx.upload.use_1200bps_touch=true
mdbt50qrx.upload.wait_for_upload_port=true
mdbt50qrx.upload.maximum_size=815104
mdbt50qrx.upload.maximum_data_size=237568

# Build
mdbt50qrx.build.mcu=cortex-m4
mdbt50qrx.build.f_cpu=64000000
mdbt50qrx.build.board=MDBT50Q_RX
mdbt50qrx.build.core=adafruit:nRF5
mdbt50qrx.build.variant=raytac_mdbt50q_rx
mdbt50qrx.build.usb_manufacturer="Switch Science, Inc."
mdbt50qrx.build.usb_product="MDBT50Q-RX Dongle Bootloader"
mdbt50qrx.build.extra_flags=-DNRF52840_XXAA {build.flags.usb} "-I{build.core.path}/../../libraries/Adafruit_TinyUSB_Arduino/src/arduino"
mdbt50qrx.build.ldscript=nrf52840_s140_v6.ld
mdbt50qrx.build.vid=0x2786
mdbt50qrx.build.pid=0x920D

# SofDevice Menu
mdbt50qrx.menu.softdevice.s140v6=0.3.2 SoftDevice s140 6.1.1
mdbt50qrx.menu.softdevice.s140v6.build.sd_name=s140
mdbt50qrx.menu.softdevice.s140v6.build.sd_version=6.1.1
mdbt50qrx.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
mdbt50qrx.menu.debug.l0=Level 0 (Release)
mdbt50qrx.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
mdbt50qrx.menu.debug.l1=Level 1 (Error Message)
mdbt50qrx.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
mdbt50qrx.menu.debug.l2=Level 2 (Full Debug)
mdbt50qrx.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
mdbt50qrx.menu.debug.l3=Level 3 (Segger SystemView)
mdbt50qrx.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
mdbt50qrx.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Switch Science MDBT42V Breakout
# ----------------------------------
mdbt42vbreakout.name=Switch Science MDBT42V Breakout
mdbt42vbreakout.bootloader.tool=adafruit:bootburn

# Upload
mdbt42vbreakout.upload.tool=adafruit:nrfutil
mdbt42vbreakout.upload.protocol=nrfutil
mdbt42vbreakout.upload.use_1200bps_touch=false
mdbt42vbreakout.upload.wait_for_upload_port=false
mdbt42vbreakout.upload.native_usb=false
mdbt42vbreakout.upload.maximum_size=290816
mdbt42vbreakout.upload.maximum_data_size=52224

# Build
mdbt42vbreakout.build.mcu=cortex-m4
mdbt42vbreakout.build.f_cpu=64000000
mdbt42vbreakout.build.board=SSCI_MDBT42V_BREAKOUT
mdbt42vbreakout.build.core=adafruit:nRF5
mdbt42vbreakout.build.variant=mdbt42vbreakout
mdbt42vbreakout.build.usb_manufacturer="Switch Science, Inc."
mdbt42vbreakout.build.usb_product="SSCI MDBT42V Breakout"
mdbt42vbreakout.build.extra_flags=-DNRF52832_XXAA -DNRF52
mdbt42vbreakout.build.ldscript=nrf52832_s132_v6.ld

# SofDevice Menu
mdbt42vbreakout.menu.softdevice.s132v6=0.3.2 SoftDevice s132 6.1.1
mdbt42vbreakout.menu.softdevice.s132v6.build.sd_name=s132
mdbt42vbreakout.menu.softdevice.s132v6.build.sd_version=6.1.1
mdbt42vbreakout.menu.softdevice.s132v6.build.sd_fwid=0x00B7

# Debug Menu
mdbt42vbreakout.menu.debug.l0=Level 0 (Release)
mdbt42vbreakout.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
mdbt42vbreakout.menu.debug.l1=Level 1 (Error Message)
mdbt42vbreakout.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
mdbt42vbreakout.menu.debug.l2=Level 2 (Full Debug)
mdbt42vbreakout.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
mdbt42vbreakout.menu.debug.l3=Level 3 (Segger SystemView)
mdbt42vbreakout.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
mdbt42vbreakout.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1
